{
  "experience": [
    {
      "companyName": "Rivian",
      "date": "July 2025 - Present",
      "logo": "rivian",
      "role": "Software Engineer",
      "description": [
        "Working with the Vehicle to Cloud team to enable a more connected experience for Rivian customers"
      ]
    },
    {
      "companyName": "Rivian",
      "date": "May 2024 - August 2024",
      "logo": "rivian",
      "role": "Software Engineering Intern",
      "description": [
        "Explored the ability to deploy ML models on the edge, by running them on vehicle instead of in the cloud",
        "Created a workflow for other teams to easily deploy new ML models onto the vehicle and leverage ML in their services",
        "Designed a CPU efficient and low memory usage service for aggregating vehicle signals for use in ML inferences",
        "Implemented a comprehensive HIL test suite to ensure proper functionality of all designed services",
        "Maintained comprehensive documentation to make it easy others to maintain or adapt my services in the future."
      ]
    },
    {
      "companyName": "AFTI WatchDog",
      "date": "May 2023 - August 2023",
      "logo": "afti",
      "role": "Computer Vision Intern",
      "description": [
        "Developed a Multilabel Image Classification model using PyTorch to identify flaws in image quality with 95% accuracy.",
        "Integrated my project into the existing Image Processing Pipeline to automatically trigger defrosting commands when images are classified to be frosted over or covered in dew.",
        "Improved customer experience by reducing overall number of unclear images served to the end-user.",
        "Created comprehensive documentation, facilitating the understanding and usage of the Image Classification model, thereby leaving a lasting impact on the company's capabilities even after the completion of the internship."
      ]
    },
    {
      "companyName": "Princeton Racing Electric (FSAE)",
      "date": "September 2021 - May 2025",
      "logo": "pre",
      "role": "Chief Engineer",
      "description": [
        "Organized a team of 100+ skilled engineers in the design, development, and construction of an electric Formula-style race car",
        "Spearheaded the development of embedded systems and firmware for various vehicle subsystems, enhancing overall vehicle control and facilitating data acquisition capabilities to aid in optimizing the vehicle’s performance.",
        "Led a team of 6 engineers within the high voltage sub-team through the testing and integration of DHX Motors and Emsiso Inverters, implementing control over CAN, and collaborating closely with the Mechanical team to facilitate integration."
      ]
    },
    {
      "companyName": "Unite Tonight",
      "date": "August 2022 - May 2023",
      "logo": "UT",
      "role": "Backend Developer",
      "description": [
        "Spearheaded the development and implementation of critical functionalities for the Unite Tonight app, a social networking platform designed to facilitate event organization and attendance.",
        "Leveraged expertise in PHP and Swift to architect and deploy backend solutions on AWS, playing a pivotal role in bringing the app from conception to successful launch within a tight timeline."
      ]
    },
    {
      "companyName": "Princeton University",
      "date": "January 2022 - May 2022",
      "logo": "princeton",
      "role": "Computer Science TA",
      "description": [
        "Worked with students to increase their understanding of course material and debug their programming assignments for COS 126: An Interdisciplinary Approach"
      ]
    }
  ]
}
